export const dbC = {
    innerDb: {
        key: 'database',
        data: {
            restaurants: [
                {
                    id: 'myFirstRestaurant',
                    menuCategories: [
                        {
                            title: 'Супы',
                            dishes: [
                                {
                                    title: 'Харчо',
                                    image: '1_harcho-500x500',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: 300,
                                    price: 80,
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    },
};