export const dbC = {
    innerDb: {
        key: 'database',
        data: {
            restaurants: [
                {
                    id: 'myFirstRestaurant',
                    menuCategories: [
                        {
                            id: '0',
                            title: 'Супи',
                            dishes: [
                                {
                                    id: 'harcho',
                                    title: 'Харчо',
                                    image: '1_harcho-500x500.png',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: '300 г',
                                    price: 80,
                                },
                                {
                                    id: 'bozbashi',
                                    title: 'Бозбаші',
                                    image: '3_bozbash-500x500.png',
                                    description: 'Національна кавказька страва. Насичений ароматний суп.\n' +
                                        'Готується на бульйоні із баранини з обсмаженою ріпчастою цибулею, болгарським перцем і томатною пастою.\n' +
                                        'Подається з великими тефтелями із м’якоті баранини і куриці, риса і грузинських спецій, дольками картоплі і помідора.\n' +
                                        'Суп гострий.',
                                    weight: '350 г',
                                    price: 88,
                                },
                                {
                                    id: 'harcho1',
                                    title: 'Харчо',
                                    image: '1_harcho-500x500.png',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: '300 г',
                                    price: 80,
                                },
                                {
                                    id: 'harcho2',
                                    title: 'Харчо',
                                    image: '1_harcho-500x500.png',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: '300 г',
                                    price: 80,
                                },
                                {
                                    id: 'harcho3',
                                    title: 'Харчо',
                                    image: '1_harcho-500x500.png',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: '300 г',
                                    price: 80,
                                },
                                {
                                    id: 'harcho4',
                                    title: 'Харчо',
                                    image: '1_harcho-500x500.png',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: '300 г',
                                    price: 80,
                                },
                            ]
                        },
                        {
                            id: '1',
                            title: 'Салати',
                            dishes: [

                            ]
                        },
                        {
                            id: '2',
                            title: 'Гарячі страви',
                            dishes: [

                            ]
                        }
                    ]
                }
            ]
        }
    },
};