import { servicesC } from "./services";

export const dbC = {
    innerDb: {
        key: 'database',
        data: {
            restaurants: [
                {
                    id: 'myFirstRestaurant',
                    type: servicesC.restaurantTypes.rectangle,
                    size: { width: 10, height: 10},
                    events: [
                        {
                            id: '0',
                            title: 'МАМАХОХОТАЛА ШОУ',
                            sliderImage: 'mamahohotala.png',
                            logoImage: 'mamahohotala_logo.jpg',
                            timestamp: (new Date('2019-05-08T19:00:00')).getTime(),
                            price: "299-899",
                            text: `Це буде на 100% нова програма. Актуальний гумор на теми сьогоднішнього дня. Ми будемо жартувати про те, що ви зараз самі обговорюєте з друзями, колегами та близькими.

Це професійне ШОУ з великої літери, яке записується для телеканалу «НЛО TV», причому з усіма відповідними атрибутами.

Концертний зал з великою сценою. Яскраве світло і живий звук. Окремі декорації для кожного номера і звичайно ж камери, які знімають все, що відбувається — як на сцені, так і в залі для глядачів.

Самі номери йдуть в нон-стоп режимі, без пауз і дублів. Постановка, акторська гра і активна робота з глядачами. І одна важлива деталь: шоу проводиться для гостей в залі, а лише потім його показують на ТБ.`,
                        },
                        {
                            id: '1',
                            title: 'ІМПРОВІЗАЦІЯ ДЛЯ ДОРОСЛИХ',
                            sliderImage: 'improv.jpg',
                            logoImage: 'improv_logo.jpg',
                            timestamp: (new Date('2019-05-23T19:00:00')).getTime(),
                            price: "250-550",
                            text: `Непредсказуемо, ярко, умно, смешно, энергично, откровенно, удивительно!

«Импровизация для взрослых» — уникальный проект, который совмещает в себе театр, легендарные Бродвейские импровизационные шоу, интерактивное общение со зрителем и — самое главное — создание спектакля здесь и сейчас.

Это увлекательное действие без сценария, где главными драматургами становятся зрители. Именно они решают: где и в каких ролях окажутся актеры в следующую секунду. И задача актеров — максимально ярко развить идею зрителя, чтобы получить полноценное произведение искусства.`,
                        },
                        {
                            id: '2',
                            title: 'MISS BLONDE UKRAINE 2019',
                            sliderImage: 'blonde.jpg',
                            logoImage: 'blonde_logo.jpg',
                            timestamp: (new Date('2019-05-30T20:00:00')).getTime(),
                            price: "350-1000",
                            text: `Накануне Всемирного Дня Блондинок состоится уникальное, искрометное, найблондинистишее шоу страны — «MISS BLONDE UKRAINE-2019». Двадцать светловолосых красавиц со всех уголков Украины, включая моделей международного уровня, будут сражаться за титул лучшей блондинки страны! Кто победит в этом году? Кто она — самая красивая, самая талантливая, самая сексуальная?

Зритель будет вовлечен в круговорот феерического зрелищного действа, призванного доказать, что Мир можно сделать Светлее!

«Мiss Blonde Ukraine» — это конкурс национального масштаба, который является одним из наиболее знаковых, резонансных и рейтинговых событий в сфере индустрии красоты и моды Украины. Он пользуется неизменным интересом СМИ, привлекает большое количество широкой публики, а также представителей бизнеса, политиков, звезд и творческой интеллигенции.`,
                        },
                        {
                            id: '3',
                            title: 'ОТЕЛЛО',
                            sliderImage: 'otello.jpg',
                            logoImage: 'otello_logo.jpg',
                            timestamp: (new Date('2019-05-18T20:00:00')).getTime(),
                            price: "200-450",
                            text: `«Отелло» — одна из самых эксцентричных и смешных комедий репертуара театра «Маски». Здесь есть всё: крашеный Мавр и красавица Дездемона-девочка. И служанка её, Эмилия, далеко уже не девочка. Фокусы, песни, танцы. Малосольные огурчики, водочка и даже клубничка!`,
                        },
                        {
                            id: '4',
                            title: 'ОТЕЛЬ БЕВЕРЛИ ХИЛЛЗ',
                            sliderImage: 'hotel.jpg',
                            logoImage: 'hotel_logo.jpg',
                            timestamp: (new Date('2019-06-04T19:00:00')).getTime(),
                            price: "200-550",
                            text: `Американская комедия по мотивам трех новэл Нила Саймона – «Отель Беверли Хиллз». Яркий, наполнен юмором спектакль о судьбе трех супружеских пар в разные периоды жизни. Все три пары остановились в Лос-Анджелесе в одном и том же номере отеля «Беверли Хиллз» в одно и тоже время. Перед зрителем раскрываются истории непростых отношений бывших мужей и жен. Каждый шаг этих событий превращается в фарс. Стены гостиничного номера стали свидетелем большого количества забавных событий, и хранят тайны, с которыми в процессе спектакля познакомится зритель. Все эти истории абсолютно непохожи между собой. Но их объединяет одно чувство – любовь.

Увлекательный сюжет с плеядой звезд театра и кино: Екатериной Кистень, Алексеем Богдановичем, Натальей Васько, Татьяной Аркушенко.

Режиссер-постановщик и продюсер – Ирина Зильберман, чьи постановки с неизменным успехом долгие годы радуют театралов и заставляют задуматься о человеческих ценностях.

`
                        },
                        {
                            id: '5',
                            title: 'ЧОЛОВІК МОЄЇ ДРУЖИНИ',
                            sliderImage: 'husband.jpg',
                            logoImage: 'husband_logo.jpg',
                            timestamp: (new Date('2019-05-24T19:00:00')).getTime(),
                            price: "250-600",
                            text: `Давно не бачили по-справжньому яскравих комедій? Отже, Ви прийшли за адресою. «Чоловік моєї дружини» саме той спектакль, який своєю безпосередністю змусить Вас забути про все (так, що не забудьте вимкнути праску перед виходом із квартири).

Уявіть, що Ви готуєте обід, перете. І все це з неприродним натхненням у зв'язку з приїздом Вашої коханої. Раптом у двері дзвонить незнайомий чоловік, який видає себе за родича Вашої другої половини, про існування якого Ви вперше дізналися. З'ясовується, що він дійсно родич.

… чоловік вашої дружини.`,
                        },
                        {
                            id: '6',
                            title: 'КТО КОГО ХОЧЕТ',
                            sliderImage: 'who.jpg',
                            logoImage: 'who_logo.jpg',
                            timestamp: (new Date('2019-06-16T19:00:00')).getTime(),
                            price: "250-550",
                            text: `Спектакли о взаимоотношениях между мужчиной и женщиной, ведь эта тема близка всем и каждому. Спектакль «Кто кого хочет…?» — не исключение, а скорее подтверждение. Он о случайных неслучайных встречах и удивительных продолжениях, об остывших чувствах, которые требуют радикальных изменений (из легендарного проекта «До и После секса»). Мы говорим о настоящем и не стесняемся в выражениях! Спектакль этюдный, яркий, невероятно смешной, но и лиричный одновременно, как сам Алексей Курилко, который влюбляет в себя с первой секунды! А так же великолепная Ирина Когут.`,
                        },
                    ],
                    menuCategories: [
                        {
                            id: '0',
                            title: 'Супи',
                            dishes: [
                                {
                                    id: '0',
                                    title: 'Харчо',
                                    image: '1_harcho-500x500.png',
                                    description: 'Традиційний грузинський суп, наваристий і дуже пікантний з ярко вираженою гостротою. Готується на бульйоні із яловичини з рисом, обсмаженою ріпчастою цибулею з додавання томатної пасти, червоного перця, часника і великої кількості спецій (коріандр, хмелі-сунелі, чебрець).',
                                    weight: 300,
                                    price: 300,
                                },
                                {
                                    id: '1',
                                    title: 'Бозбаші',
                                    image: '3_bozbash-500x500.png',
                                    description: 'Національна кавказька страва. Насичений ароматний суп.\n' +
                                        'Готується на бульйоні із баранини з обсмаженою ріпчастою цибулею, болгарським перцем і томатною пастою.\n' +
                                        'Подається з великими тефтелями із м’якоті баранини і куриці, риса і грузинських спецій, дольками картоплі і помідора.\n' +
                                        'Суп гострий.',
                                    weight: 350,
                                    price: 88,
                                },
                                {
                                    id: '2',
                                    title: 'Шурпа',
                                    image: '4_shurpa-500x500.png',
                                    description: `Ситний і насичений суп. Готується на бульйоні із баранини з додавання ароматних спецій і сванської солі. Подається з половиною картоплі, дольками відварної моркви і бараниною на кістці.
                                    Перед подачею додають рублену зелень.`,
                                    weight: 400,
                                    price: 105,
                                },
                                {
                                    id: '3',
                                    title: 'Домашній суп',
                                    image: '2_k-bulion-500x500.png',
                                    description: `Легкий суп на курячому бульйоні з цибулею, морквою, лапшою і м’Якоттю курки.
                                    Подається з половиною курячого яйця і зеленню.`,
                                    weight: 300,
                                    price: 77,
                                },
                                {
                                    id: '4',
                                    title: 'КРЕМ-СУП ІЗ СПАРЖЕВОЇ КВАСОЛІ',
                                    image: '5_krem-soup-500x500.png',
                                    description: `Крем-суп із спаржевої квасолі з шинкою та кукурудзяними чіпсами`,
                                    weight: 350,
                                    price: 91,
                                },
                            ]
                        },
                        {
                            id: '1',
                            title: 'Салати',
                            dishes: [
                                {
                                    id: 'salad1',
                                    title: 'Грузинський салат з аджикою',
                                    image: 'Gryzinskiy-s-adzhikoi-500x500.jpg',
                                    description: 'Салат із свіжих бланшированих помідорів, огірків, болгарського перцю та ріпчастою цибулі. Заправляємо соусом із кінзи, шпинату, орегано, домашньої олії, волоських горіхів і зеленої аджики. За бажанням можна без цибулі',
                                    weight: 275,
                                    price: 111,
                                },
                                {
                                    id: 'salad2',
                                    title: 'ГРУЗИНСЬКИЙ САЛАТ',
                                    image: '1_gruzinskiy-500x500.png',
                                    description: `Це Must Eat грузинської кухні!
Салат із свіжих огірків, помідорів, ріпчастої цибулі, кінзи та волоських горіхів. Є трішки часнику. За бажанням можна без цибулі та з соняшниковою олією замість горіхової заправки`,
                                    weight: 305,
                                    price: 101,
                                },
                                {
                                    id: 'salad3',
                                    title: 'Акекілі',
                                    image: '2_akekeli-500x500.png',
                                    description: `Запечені в печі баклажани, болгарський перець і томати з ріпчастою цибулею, кінзою та заправкою із волоських горіхів. Є трішки часнику. За бажанням можна без цибулі`,
                                    weight: 300,
                                    price: 111,
                                },
                                {
                                    id: 'salad4',
                                    title: 'Тбілісурі',
                                    image: '3_tbilisury-500x500.png',
                                    description: `Смажена куряча печінка на свіжих помідорах та крутому яйці між смаженими слайсами баклажанів та кабачків. Зверху все присипаємо тертим жовтком та зернами стиглого гранату`,
                                    weight: 270,
                                    price: 92,
                                },
                                {
                                    id: 'salad5',
                                    title: 'Кето',
                                    image: 'Keto-500x500.jpg',
                                    description: `Просто та зі смаком! Біле м'ясо курча з пікантною морквою під майонезом. Є трішки часнику`,
                                    weight: 300,
                                    price: 107,
                                },
                            ]
                        },
                        {
                            id: '2',
                            title: 'Гарячі страви',
                            dishes: [
                                {
                                    id: 'hot1',
                                    title: 'ЧАШОШУЛІ ЗІ СВИНИНИ',
                                    image: '1_chashoshuli-500x500.png',
                                    description: 'Тушкована свинина з помідорами, болгарським перцем, ріпчастою цибулею, часником, кінзою та спеціями, аджикою і томатною пастою',
                                    weight: 320,
                                    price: 125,
                                },
                                {
                                    id: 'hot2',
                                    title: 'ЧАНАХІ',
                                    image: '2_chanahi-500x500.png',
                                    description: 'Тушкована свинина з підсмаженою картоплею, баклажаном, болгарським перцем і помідорами. Додоводимо до смаку аджикою, свіжою зеленню та спеціями',
                                    weight: 350,
                                    price: 131,
                                },
                                {
                                    id: 'hot3',
                                    title: 'ОДЖАХУРІ ЗІ СВИНИНИ',
                                    image: '3_adjahuri-500x500.png',
                                    description: 'Запечені в кеці смажені шматочки свинної вирізки разом із картоплею та цибулею. До смаку доводимо часником та спеціями',
                                    weight: 250,
                                    price: 131,
                                },
                                {
                                    id: 'hot4',
                                    title: 'ТАВА-КЕБАБ',
                                    image: '4_tava-kebab-500x500.png',
                                    description: 'Кебаб із баранини з цибулею та спеціями — барбарис, сіль і перець. Привеземо на лаваші з соусом Сацебелі',
                                    weight: 320,
                                    price: 155,
                                },
                                {
                                    id: 'hot5',
                                    title: 'ЧКМЕРУЛІ',
                                    image: '5_chkmeruli-500x500.png',
                                    description: 'Ціле смаженне курча у горіхово-сметаному соусі з часником та спеціями. Використовуємо волоські горіхі',
                                    weight: 450,
                                    price: 185,
                                },
                                {
                                    id: 'hot6',
                                    title: 'ДОЛМА',
                                    image: '6_dolma-500x500.png',
                                    description: 'Виноградні листя фаршировані м\'ясом яловичини та свинини з рисом, ріпчастою цибулею, кінзою та спеціями. Привеземо із вершковим соусом',
                                    weight: 235,
                                    price: 145,
                                },
                                {
                                    id: 'hot7',
                                    title: 'ЧАКАПУЛІ ІЗ БАРАНИНИ',
                                    image: '7_chakapuli-500x500.png',
                                    description: 'Тушкована на повільному вогні баранина з тархуном, часником, ріпчастою й зеленою цибулею й базиліком. Тушкуємо на минеральній воді та для смаку додаємо зелений ткемалі',
                                    weight: 250,
                                    price: 151,
                                },
                                {
                                    id: 'hot8',
                                    title: 'ЛОБІО ПО-МЕГРЕЛЬСЬКИ',
                                    image: '7_lobio-500x500.png',
                                    description: 'Червона квасоля, приготована за традиційним рецептом з цибулею, волоськими горіхами, спеціями та кінзою. Подаємо з маринованою капустою із перцем та буряком',
                                    weight: 300,
                                    price: 87,
                                },
                                {
                                    id: 'hot9',
                                    title: 'АДЖАПСАНДАЛІ',
                                    image: '1_adjapsandali-500x500.png',
                                    description: 'Аджабсандалі — овочеве рагу, але ще крутіше! Готуємо із баклажанів, картоплі, ріпчастої цибулі, стручкової квасолі, болгарського перцю й томатів. Приправляємо часником та спеціями',
                                    weight: 300,
                                    price: 102,
                                },
                            ]
                        },
                        {
                            id: '3',
                            title: 'Хачапурі',
                            dishes: [
                                {
                                    id: 'hachapuri1',
                                    title: 'ХАЧАПУРІ ПО-ІМЕРЕТИНСЬКИ',
                                    image: '1_imeretinskiy-500x500.png',
                                    description: `Ароматний хачапурі з начинкою із бринзи і сира сулугуні. Перед подачею верх гарячого хачапурі змащується вершковим маслом.`,
                                    weight: 900,
                                    price: 243,
                                },
                                {
                                    id: 'hachapuri2',
                                    title: 'ХАЧАПУРІ ПО-МЕГРЕЛЬСЬКИ',
                                    image: '2_megrelskiy-500x500.png',
                                    description: `Ароматний хачапурі з начинкою із сира сулугуні, змащується яйцем та випікається у печі. Незадовго до закінчення приготування зверху засипається також сиром сулугуні і доводиться до рум’яної корочки. Після випікання верх гарячого хачапурі змається вершковим маслом.`,
                                    weight: 1000,
                                    price: 253,
                                },
                                {
                                    id: 'hachapuri3',
                                    title: 'ХАЧАПУРІ ПО-АДЖАРСЬКИ',
                                    image: '3_adjarskiy-500x500.png',
                                    description: `Ароматний хачапурі у формі човника з сиром сулугуні у бортиках. Перед подачею додають жовток сирого яйця таким чином, щоб жовток був цілий, а верх гарячого хачапурі змащується вершковим маслом і подаються зі шматочком вершкового масла.`,
                                    weight: 1000,
                                    price: 243,
                                },
                                {
                                    id: 'hachapuri4',
                                    title: 'ХАЧАПУРІ «МАНАНА»',
                                    image: '4_manana-500x500.png',
                                    description: `Фірмовий хачапурі ресторана з начинкою із фаршу яловичини та свинини з додавання свіжої ріпчастої цибулі, невеликої кількості часника і ароматних грузинських спецій (кондарі, хмелі-сунелі, уцко-сунелі, сванської солі, коріандра).
                                    Перед закінченням приготування зверху викладають сир сулугуні та свіжі помідори, після чого запікають.
                                    Перед подачею змащується вершковим маслом.`,
                                    weight: 500,
                                    price: 167,
                                },
                                {
                                    id: 'hachapuri5',
                                    title: 'ХАЧАПУРІ ПО-ОСЕТИНСЬКИ',
                                    image: '5_osetinskiy-500x500.png',
                                    description: `Ніжний хачапурі з начинкою із шпинату та сиру сулугуні.`,
                                    weight: 450,
                                    price: 123,
                                },
                                {
                                    id: 'hachapuri6',
                                    title: 'ЛОБІОТІ ПО-АДЖАРСЬКИ',
                                    image: '8_lobioti_adjarskiy-500x500.png',
                                    description: `Ароматний хачапурі від Манани у формі човника з сиром сулугуні у бортиках і начинкою із відварної червоної квасолі із грузинськими спеціями, чебрецем і засмаженою до золотистого кольору цибулею з додаванням горіхової пасти і кінзи.
                                    Подають з маринованим перцем цицак.
                                    Смак пікантний, трошки гострий.`,
                                    weight: 460,
                                    price: 87,
                                },
                                {
                                    id: 'hachapuri7',
                                    title: 'АДЖАПСАНДАЛІ ПО-АДЖАРСЬКИ',
                                    image: '9_adjapsandali_adjarskiy-500x500.png',
                                    description: `Ароматний хачапурі від Манани у формі човника з сиром сулугуні у бортиках і ароматним овочевим рагу із баклажану, картоплі, спаржевої квасолі, болгарського перця і помідора з грузинськими спеціями і часником.
                                    Страва пікантна.`,
                                    weight: 430,
                                    price: 92,
                                },
                                {
                                    id: 'hachapuri8',
                                    title: 'ЧАКАПУЛІ ПО-АДЖАРСЬКИ',
                                    image: '7_chakapuli_adjarskiy-500x500.png',
                                    description: `Ароматний хачапурі від Манани у формі човника з сиром сулугуні у бортиках і начинкою із баранини, яка тушиться у суміші із мінеральної води з пивом, часником і зеленою цибулею з великою кількістю зелені тархуна і кінзи. Перед закінченням приготування додається трошки соусу ткемалі.`,
                                    weight: 430,
                                    price: 165,
                                },
                            ]
                        },
                        {
                            id: '4',
                            title: 'Хінкалі',
                            dishes: [
                                {
                                    id: 'hinkali1',
                                    title: 'ХІНКАЛІ ТБИЛІСЬКІ',
                                    image: 'hinkali-tbiliski-500x500.png',
                                    description: `Фарш із м’якоті свинини та яловичини з ріпчастою цибулею, кінзою і ароматною спецією «горна Зіра» із регіону Душеті.`,
                                    weight: 300,
                                    price: 100,
                                },
                                {
                                    id: 'hinkali2',
                                    title: 'ХІНКАЛІ ПШАВСЬКІ',
                                    image: 'hinkali-tbiliski-500x500.png',
                                    description: `Фарш зі свіжої баранини з ріпчастою цибулею, свіжої м’яти, кінзою і ароматною спецією «горна Зіра».`,
                                    weight: 300,
                                    price: 124,
                                },
                            ]
                        }
                    ],
                    tables: [
                        {
                            id: "table1",
                            number: 1,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 0, y: 0.5},
                            reservations: [
                                {
                                    id: '0',
                                    userId: '0',
                                    date: (new Date(2019,4,10)).getTime(),
                                    startTime: {h: 18, m: 30},
                                    endTime: {h: 20, m: 0},
                                },
                                {
                                    id: '1',
                                    userId: '1',
                                    date: (new Date(2019,4,10)).getTime(),
                                    startTime: {h: 20, m: 0},
                                    endTime: {h: 21, m: 30},
                                }
                            ]
                        },
                        {
                            id: "table2",
                            number: 2,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 0, y: 2.7},
                            reservations: []
                        },
                        {
                            id: "table3",
                            number: 3,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 0, y: 6.1},
                            reservations: [{
                                id: '2',
                                userId: '1',
                                date: (new Date(2019,4,10)).getTime(),
                                startTime: {h: 18, m: 15},
                                endTime: {h: 20, m: 30},
                            }]
                        },
                        {
                            id: "table4",
                            number: 4,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 0, y: 8.3},
                            reservations: []
                        },
                        {
                            id: "table5",
                            number: 5,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 8, y: 0.5},
                            reservations: []
                        },
                        {
                            id: "table6",
                            number: 6,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 8, y: 2.7},
                            reservations: []
                        },
                        {
                            id: "table7",
                            number: 7,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 8, y: 6.1},
                            reservations: []
                        },
                        {
                            id: "table8",
                            number: 8,
                            type: servicesC.restaurantTypes.rectangle,
                            size: {
                                width: 2,
                                height: 1.2,
                            },
                            position: { x: 8, y: 8.3},
                            reservations: []
                        },
                    ]
                }
            ],
            users: [
                {
                    id: '0',
                    username: "magnus",
                    password: "magnus1234",
                    name: "Владимир",
                    surname: "Скорик",
                    telephone: "096-0569073"
                },
                {
                    id: '1',
                    username: "test",
                    password: "test1234",
                    name: "Владимир",
                    surname: "Скорик",
                    telephone: "096-0569073"
                },
            ],
        }
    },
};
